_posts/programming/2022-04-06-cppcoreguidelines-f3.html
---
layout: post
title: CppCoreGuidelines F.3 函数要短小、简洁
categories: [programming]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
F.3: Keep functions short and simple
</p>


<p>
<b>理由</b>
</p>

<p>
长函数复杂难读、导致变量范围过大。复杂逻辑结构过长，容易隐藏逻辑错误。
</p>


<p>
<b>例子</b>
</p>

<div class="org-src-container">
<pre class="src src-bad src-C++"><span style="color: #7F0055; font-weight: bold;">double</span> <span style="color: #0000ff; font-weight: bold;">simple_func</span><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">double</span> <span style="color: #000000;">val</span>, <span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000;">flag1</span>, <span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000;">flag2</span><span style="color: #707183;">)</span>
    <span style="color: #3F7F5F;">// simple_func: takes a value and calculates the expected ASIC output,</span>
    <span style="color: #3F7F5F;">// given the two mode flags.</span>
<span style="color: #707183;">{</span>
    <span style="color: #7F0055; font-weight: bold;">double</span> <span style="color: #000000;">intermediate</span>;
    <span style="color: #7F0055; font-weight: bold;">if</span> <span style="color: #7388d6;">(</span>flag1 <span style="color: #7F0055; font-weight: bold;">&gt;</span> <span style="color: #110099;">0</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #000000;">intermediate</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #3a5fcd; font-weight: bold;">func1</span><span style="color: #909183;">(</span>val<span style="color: #909183;">)</span>;
        <span style="color: #7F0055; font-weight: bold;">if</span> <span style="color: #909183;">(</span>flag2 <span style="color: #7F0055; font-weight: bold;">%</span> <span style="color: #110099;">2</span><span style="color: #909183;">)</span>
             <span style="color: #000000;">intermediate</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #3a5fcd; font-weight: bold;">sqrt</span><span style="color: #909183;">(</span>intermediate<span style="color: #909183;">)</span>;
    <span style="color: #7388d6;">}</span>
    <span style="color: #7F0055; font-weight: bold;">else</span> <span style="color: #7F0055; font-weight: bold;">if</span> <span style="color: #7388d6;">(</span>flag1 <span style="color: #7F0055; font-weight: bold;">==</span> <span style="color: #110099;">-1</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #000000;">intermediate</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #3a5fcd; font-weight: bold;">func1</span><span style="color: #909183;">(</span><span style="color: #7F0055; font-weight: bold;">-</span>val<span style="color: #909183;">)</span>;
        <span style="color: #7F0055; font-weight: bold;">if</span> <span style="color: #909183;">(</span>flag2 <span style="color: #7F0055; font-weight: bold;">%</span> <span style="color: #110099;">2</span><span style="color: #909183;">)</span>
             <span style="color: #000000;">intermediate</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #3a5fcd; font-weight: bold;">sqrt</span><span style="color: #909183;">(</span><span style="color: #7F0055; font-weight: bold;">-</span>intermediate<span style="color: #909183;">)</span>;
        <span style="color: #000000;">flag1</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #7F0055; font-weight: bold;">-</span>flag1;
    <span style="color: #7388d6;">}</span>
    <span style="color: #7F0055; font-weight: bold;">if</span> <span style="color: #7388d6;">(</span><span style="color: #3a5fcd; font-weight: bold;">abs</span><span style="color: #909183;">(</span>flag2<span style="color: #909183;">)</span> <span style="color: #7F0055; font-weight: bold;">&gt;</span> <span style="color: #110099;">10</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
        <span style="color: #000000;">intermediate</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #3a5fcd; font-weight: bold;">func2</span><span style="color: #909183;">(</span>intermediate<span style="color: #909183;">)</span>;
    <span style="color: #7388d6;">}</span>
    <span style="color: #7F0055; font-weight: bold;">switch</span> <span style="color: #7388d6;">(</span>flag2 <span style="color: #7F0055; font-weight: bold;">/</span> <span style="color: #110099;">10</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span>
    <span style="color: #7F0055; font-weight: bold;">case</span> <span style="color: #110099;">1</span>: <span style="color: #7F0055; font-weight: bold;">if</span> <span style="color: #909183;">(</span>flag1 <span style="color: #7F0055; font-weight: bold;">==</span> <span style="color: #110099;">-1</span><span style="color: #909183;">)</span> <span style="color: #7F0055; font-weight: bold;">return</span> <span style="color: #3a5fcd; font-weight: bold;">finalize</span><span style="color: #909183;">(</span>intermediate, <span style="color: #110099;">1.171</span><span style="color: #909183;">)</span>;
            <span style="color: #7F0055; font-weight: bold;">break</span>;
    <span style="color: #7F0055; font-weight: bold;">case</span> <span style="color: #110099;">2</span>: <span style="color: #7F0055; font-weight: bold;">return</span> <span style="color: #3a5fcd; font-weight: bold;">finalize</span><span style="color: #909183;">(</span>intermediate, <span style="color: #110099;">13.1</span><span style="color: #909183;">)</span>;
    <span style="color: #7F0055; font-weight: bold;">default</span>: <span style="color: #7F0055; font-weight: bold;">break</span>;
    <span style="color: #7388d6;">}</span>
    <span style="color: #7F0055; font-weight: bold;">return</span> <span style="color: #3a5fcd; font-weight: bold;">finalize</span><span style="color: #7388d6;">(</span>intermediate, <span style="color: #110099;">0.</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
</pre>
</div>

<p>
以上代码太过复杂。很难判断分支有没有全部覆盖到。
</p>

<p>
我们可以这样重构：
</p>

<div class="org-src-container">
<pre class="src src- src-C++"><span style="color: #7F0055; font-weight: bold;">double</span> <span style="color: #0000ff; font-weight: bold;">func1_muon</span><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">double</span> <span style="color: #000000;">val</span>, <span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000;">flag</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #3F7F5F;">// ???</span>
<span style="color: #707183;">}</span>

<span style="color: #7F0055; font-weight: bold;">double</span> <span style="color: #0000ff; font-weight: bold;">func1_tau</span><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">double</span> <span style="color: #000000;">val</span>, <span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000;">flag1</span>, <span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000;">flag2</span><span style="color: #707183;">)</span>
<span style="color: #707183;">{</span>
    <span style="color: #3F7F5F;">// ???</span>
<span style="color: #707183;">}</span>

<span style="color: #7F0055; font-weight: bold;">double</span> <span style="color: #0000ff; font-weight: bold;">simple_func</span><span style="color: #707183;">(</span><span style="color: #7F0055; font-weight: bold;">double</span> <span style="color: #000000;">val</span>, <span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000;">flag1</span>, <span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000;">flag2</span><span style="color: #707183;">)</span>
    <span style="color: #3F7F5F;">// simple_func: takes a value and calculates the expected ASIC output,</span>
    <span style="color: #3F7F5F;">// given the two mode flags.</span>
<span style="color: #707183;">{</span>
    <span style="color: #7F0055; font-weight: bold;">if</span> <span style="color: #7388d6;">(</span>flag1 <span style="color: #7F0055; font-weight: bold;">&gt;</span> <span style="color: #110099;">0</span><span style="color: #7388d6;">)</span>
        <span style="color: #7F0055; font-weight: bold;">return</span> <span style="color: #3a5fcd; font-weight: bold;">func1_muon</span><span style="color: #7388d6;">(</span>val, flag2<span style="color: #7388d6;">)</span>;
    <span style="color: #7F0055; font-weight: bold;">if</span> <span style="color: #7388d6;">(</span>flag1 <span style="color: #7F0055; font-weight: bold;">==</span> <span style="color: #110099;">-1</span><span style="color: #7388d6;">)</span>
        <span style="color: #3F7F5F;">// handled by func1_tau: flag1 = -flag1;</span>
        <span style="color: #7F0055; font-weight: bold;">return</span> <span style="color: #3a5fcd; font-weight: bold;">func1_tau</span><span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">-</span>val, flag1, flag2<span style="color: #7388d6;">)</span>;
    <span style="color: #7F0055; font-weight: bold;">return</span> <span style="color: #110099;">0.</span>;
<span style="color: #707183;">}</span>
</pre>
</div>


<p>
<b>注意</b>
</p>

<p>
一个函数“无法满屏显示”就太长了。5 行以内的函数比较正常。
</p>


<p>
<b>注意</b>
</p>

<p>
把长函数拆成高内聚的独立函数。小函数也很容易内联，这样函数调用也不会带来太大开销。
</p>


<p>
<b>强化</b>
</p>
<ul class="org-ul">
<li>标注无法“一个屏幕显示”的函数。一屏多大？140 字符x 60行。差不多一张书页大小。</li>
<li>标注太复杂的函数。多复杂？可以使用圈复杂度分析。10 个逻辑分支以上就够复杂的了。</li>
</ul>
